{
  "tabsName": {
    "skills": "Umiejętności",
    "education": "Edukacja",
    "experience": "Doświadczenie",
    "projects": "Projekty"
  },
  "title": "Programista Frontend",
  "tech-skills": [
    "TypeScript",
    "JavaScript",
    "React",
    "Next.js",
    "TailwindCSS",
    "JEST",
    "Node.js",
    "Express.js",
    "Git",
    "Scrum",
    "HTML",
    "CSS",
    "Python",
    "SQL",
    "Firebase",
    "AWS"
  ],
  "computer-skills": [
    "Windows",
    "macOS",
    "Unix",
    "Pasjonat sprzętu komputerowego"
  ],
  "soft-skills": [
    "Krytyczne myślenie",
    "Kreatywność",
    "Praca zespołowa",
    "Dbałość o szczegóły",
    "Chęć poszerzania wiedzy",
    "Rozwiązywanie problemów"
  ],
  "about": "Jestem zaangażowanym Frontend Developerem z silną biegłością w React, popartą 4-letnim doświadczeniem w ciągłym rozwoju frontendowym. Moja przygoda z programowaniem rozpoczęła się 6 lat temu i konsekwentnie doskonaliłem swoje umiejętności, aby stać się biegłym programistą. Jestem pasjonatem dalszego pogłębiania mojej wiedzy w zakresie programowania frontendowego, a moja ciekawość rozciąga się na sferę sprzętu komputerowego i najnowszych osiągnięć w branży",
  "education": [
    {
      "school": "Politechnika Gdańska",
      "degree": "Inżynier",
      "field": "Informatyka stosowana w fizyce",
      "start": "2017",
      "end": "2022"
    },
    {
      "school": "Politechnika Gdańska",
      "degree": "Magister",
      "field": "Informatyka stosowana w fizyce",
      "start": "2022",
      "end": "2024"
    }
  ],
  "experience": [
    {
      "company": "Grid Dynamics",
      "position": "Junior Frontend Developer",
      "start": "January 2023",
      "end": "October 2023",
      "tech": [
        "React with Redux",
        "JavaScript",
        "HTML",
        "CSS",
        "Material UI",
        "React router",
        "JEST",
        "Scrum",
        "Git",
        "Figma",
        "Jira"
      ]
    },
    {
      "company": "Grid Dynamics",
      "position": "Frontend Developer Intern",
      "start": "May 2022",
      "end": "December 2023",
      "tech": [
        "React with Redux",
        "JavaScript",
        "TypeScript",
        "HTML",
        "CSS",
        "Node.js",
        "TailwindCSS",
        "JEST",
        "Scrum",
        "Git",
        "Figma",
        "AWS"
      ]
    },
    {
      "company": "New Ventures",
      "position": "Junior Web Developer",
      "start": "October 2020",
      "end": "November 2022",
      "tech": ["JavaScript", "HTML5", "CSS3", "jQuery", "WordPress", "Krpano"]
    }
  ],
  "projects": [
    {
      "name": "Portfolio Website",
      "tech": ["React", "Next.js", "TailwindCSS", "TypeScript", "Git"]
    },
    {
      "name": "Webtail React Boilerplate",
      "tech": [
        "Webpack",
        "Babel",
        "ESlint",
        "Prettier",
        "React",
        "TypeScript",
        "TailwindCSS"
      ],
      "link": "https://github.com/DanielFijolek/webtail-react-boilerplate",
      "desc": [
        "Stworzyłem własny React Boilerplate z Webpack i Babel. Jest wstępnie skonfigurowany z Typescript, TailwindCSS, ESlint i Prettier."
      ]
    },
    {
      "name": "Exercise Tracker",
      "tech": ["Node.js", "express", "TypeScript", "SQLite", "RESTFull API"],
      "link": "https://github.com/DanielFijolek/exercise_tracker",
      "desc": [
        "Starając się poszerzyć swoje umiejętności w zakresie tworzenia backendu, opracowałem aplikację 'Exercise Tracker' przy użyciu Node.js, Express i TypeScript. Projekt ten był przedsięwzięciem edukacyjnym mającym na celu zdobycie praktycznego doświadczenia z tymi technologiami",
        "Aplikacja jest zbudowana wokół RESTful API z walidacją danych. Oferuje prosty, ale funkcjonalny interfejs z punktami końcowymi do tworzenia i pobierania danych użytkownika, a także do rejestrowania i pobierania informacji o ćwiczeniach użytkownika",
        "Kluczowe funkcje aplikacji obejmują:",
        "- Zarządzanie użytkownikami: Punkty końcowe do tworzenia i pobierania danych użytkownika",
        "- Rejestrowanie ćwiczeń: Funkcjonalność rejestrowania i pobierania informacji o ćwiczeniach użytkownika"
      ]
    },
    {
      "name": "Twitter Clone",
      "tech": ["React", "TypeScript", "ReactQuery", "Axios", "TailwindCSS"],
      "link": "https://github.com/DanielFijolek/twitter_clone",
      "desc": [
        "Twitter Clone to osobisty projekt, który zainicjowałem jako plac zabaw do nauki, aby poznać i opanować React Query. To zadanie pozwoliło mi pogłębić moje zrozumienie nowoczesnych technologii tworzenia stron internetowych i ich praktycznych zastosowań. Kluczowe szczegóły projektu obejmują:",
        "- Wykorzystując stos technologii składający się z React, TypeScript, React Query, Axios i TailwindCSS, miałem na celu zbudowanie responsywnej aplikacji internetowej, która odzwierciedla funkcjonalności popularnej platformy mediów społecznościowych",
        "- Projekt obejmuje przyjazne dla użytkownika funkcje, takie jak możliwość tworzenia kont użytkowników i bezpiecznego logowania"
      ]
    },
    {
      "name": "Smart sprout cultivation system",
      "tech": [
        "React",
        "Javascript",
        "React",
        "Router",
        "JavaScript",
        "CSS3",
        "Firebase",
        "Scrum"
      ],
      "link": "https://github.com/DanielFijolek/smart_sprout_cultivation",
      "desc": [
        "W ramach mojej pracy dyplomowej opracowałem aplikację internetową do sterowania inteligentnym systemem uprawy kiełków. Projekt ten, zlecony przez firmę Nlightnin Production, został zbudowany przy użyciu React i bazy danych Firebase.",
        "Aplikacja, zaprojektowana przy użyciu React, React Router, JavaScript i CSS3, zapewnia przyjazny dla użytkownika interfejs do zarządzania systemem uprawy. Jest ona podzielona na trzy odrębne sekcje:",
        "- Zakładka Control: Umożliwia użytkownikom zarządzanie komponentami, takimi jak diody LED, pompy wodne i wentylatory.",
        "- Zakładka wyświetlania pomiarów: Wyświetla pomiary w czasie rzeczywistym, takie jak wilgotność, temperatura, poziom hałasu i waga gleby.",
        "- Zakładka Graphical Representation: Umożliwia użytkownikom wizualizację danych za pomocą wykresów, wybierając określone czujniki i zakresy czasowe do analizy.",
        "Projekt był zarządzany przy użyciu metodologii Scrum, zapewniając jasną komunikację i terminowe dostawy."
      ]
    },
    {
      "name": "Diet controling web application",
      "tech": [
        "JavaScript",
        "HTML5",
        "CSS3",
        "Node.JS",
        "Express.JS",
        " MySQL"
      ],
      "link": "https://github.com/DanielFijolek/diet_web_application",
      "desc": [
        "Wykorzystując waniliowy JavaScript na frontendzie i Node.js z Express.js na zapleczu, stworzyłem płynne połączenie między interfejsem użytkownika a serwerem, zapewniając płynny przepływ danych",
        "Aplikacja zawierała bezpieczny panel administratora z możliwością logowania. Administratorzy mogli efektywnie zarządzać kontami użytkowników, zapewniając integralność i bezpieczeństwo danych."
      ]
    }
  ]
}
